## Plan Result (Managed_Identity_dev - Managed_Identity)




<pre><code>Plan: 1 to add, 4 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.genesis_rg_contributor[0]
* Update
  * azurerm_resource_group.application-mi
  * azurerm_user_assigned_identity.kubelet_uami
  * azurerm_user_assigned_identity.sops-mi
  * azurerm_user_assigned_identity.wi-admin-mi




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.application-mi will be updated in-place
  ~ resource "azurerm_resource_group" "application-mi" {
        id         = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/managed-identities-dev-rg"
        name       = "managed-identities-dev-rg"
      ~ tags       = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.genesis_rg_contributor[0] will be created
  + resource "azurerm_role_assignment" "genesis_rg_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6c5fded7-1350-4d99-b404-8f57d0025643"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/genesis-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_user_assigned_identity.kubelet_uami will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "kubelet_uami" {
        id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-kubelet-dev-mi"
        name                = "aks-kubelet-dev-mi"
      ~ tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/aks-sds-deploy"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
          - "startupMode"  = "always" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # azurerm_user_assigned_identity.sops-mi will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "sops-mi" {
        id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-dev-mi"
        name                = "aks-dev-mi"
      ~ tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/aks-sds-deploy"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
          - "startupMode"  = "always" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # azurerm_user_assigned_identity.wi-admin-mi will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "wi-admin-mi" {
        id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/managed-identities-dev-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/admin-dev-mi"
        name                = "admin-dev-mi"
      ~ tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/aks-sds-deploy"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
          - "startupMode"  = "always" -> null
        }
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 4 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label Managed_Identity_dev - Managed_Identity/add-or-update: POST https://api.github.com/repos/hmcts/aks-sds-deploy/issues/667/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":667,"Program":"tfcmt","SHA1":"","Target":"Managed_Identity_dev - Managed_Identity","Vars":{}} -->